Reports/ОтчётПоПринятымИПропущеннымЗвонкамТелефонаДоверия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчётПоПринятымИПропущеннымЗвонкамТелефонаДоверия</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗвонков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КвоПринятыхЗвонков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоПропущенныхЗвонков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДень</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодЧас</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчётПоПринятымИПропущеннымЗвонкамТелефонаДоверия/Forms/ФормаОтчета/Ext/Form/Module.bsl
//+++АК SHEP 2018.01.25 ИП-00017665.02
// Добавлен новый отчёт "ОтчётПоПринятымИПропущеннымЗвонкамТелефоновДоверия" на основании "ОтчётПоПринятымИПропущеннымЗвонкам", тоже сделанного мной )

&НаКлиенте
Процедура Сформировать(Команда)
	
	СкомпоноватьРезультат(); //Результат, ДанныеРасшифровкиКД);
	Возврат;
	
	ТекстОшибки = СформироватьНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Предупреждение(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ДатаНачала = Период.ДатаНачала; ДатаОкончания = Период.ДатаОкончания;
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат "Дата начала и окончания периода должны быть заполнены!";
	КонецЕсли;
	
	СписокНомеров = Новый СписокЗначений;
	СтруктураНомеров = Новый Структура("НомераТелефонаДоверия", "Телефон доверия");
	Для Каждого КлючИЗначение Из СтруктураНомеров Цикл
		
		ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(КлючИЗначение.Ключ));
		Если НЕ ЗначениеПараметра.Использование ИЛИ НЕ ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда Продолжить; КонецЕсли;
		
		МассивНомеров = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ЗначениеПараметра.Значение, ",");
		Для Каждого Номер Из МассивНомеров Цикл
			НомерТелефона = АК_ТелефонияСервер.ОчиститьНомерТелефона(Номер);
			Если СписокНомеров.НайтиПоЗначению(НомерТелефона) = Неопределено Тогда
				СписокНомеров.Добавить(НомерТелефона, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если СписокНомеров.Количество() = 0 Тогда Возврат "Не заполнены номера телефонов!"; КонецЕсли;
	
	ЗаполнитьТЗнЗвонков(ДатаНачала, ДатаОкончания, СписокНомеров);
	Отчет.ТаблицаЗвонков.Загрузить(РеквизитФормыВЗначение("ТЗнЗвонков"));
	Возврат "";
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// Сформируем структуру внешних данных
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗнЗвонков", РеквизитФормыВЗначение("ТЗнЗвонков"));
	
	ДанныеРасшифровкиКД = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//ДанныеРасшифровкиКД = ДанныеРасшифровки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровкиКД);
	
	// Инициализируем процессор СКД
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровкиКД, Истина);
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКД, ЭтаФорма.УникальныйИдентификатор);
	
	// Инициализируем процессор вывода
	Результат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЗнЗвонков(ДатаНачала, ДатаОкончания, СписокНомеров)
	
	ТЗнЗвонков.Очистить();
	
	ТЗн = АК_ТелефонияСервер.ПрочитатьЛогAsterisk(ДатаНачала, ДатаОкончания);
	
	Для Каждого СтрокаТЗн Из ТЗн Цикл
		
		НомерТелефона = СокрЛП(СтрокаТЗн.src);
		
		ЭлементСписка = СписокНомеров.НайтиПоЗначению(НомерТелефона);
		Если ЭлементСписка = Неопределено Тогда Продолжить; КонецЕсли;
		
		НоваяСтрокаТЗнЗвонков = ТЗнЗвонков.Добавить();
		НоваяСтрокаТЗнЗвонков.Дата = СтрокаТЗн.calldate;
		НоваяСтрокаТЗнЗвонков.ПериодДень = СтрокаТЗн.calldate;
		НоваяСтрокаТЗнЗвонков.ПериодЧас = СтрокаТЗн.calldate;
		НоваяСтрокаТЗнЗвонков.КатегорияТелефона = ЭлементСписка.Представление;
		НоваяСтрокаТЗнЗвонков.НомерТелефона = НомерТелефона;
		НоваяСтрокаТЗнЗвонков.Статус = СтрокаТЗн.disposition;
		//НоваяСтрокаТЗнЗвонков.КвоПринятыхЗвонков = ?(СтрокаТЗн.NotAnswered, 0, 1);
		НоваяСтрокаТЗнЗвонков.КвоПринятыхЗвонков = ?(НоваяСтрокаТЗнЗвонков.Статус = "ANSWERED", 1, 0);
		НоваяСтрокаТЗнЗвонков.КвоПропущенныхЗвонков = 1 - НоваяСтрокаТЗнЗвонков.КвоПринятыхЗвонков;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки00(Элемент, Расшифровка, СтандартнаяОбработка)
Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Истина;
	
	//ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиАдрес);
	//РезультатОбработкаРасшифровкиНаСервере(ПоместитьВоВременноеХранилище(Расшифровка));
	Возврат;
	
	//СхемаКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ЭтаФорма.ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.Отчет));
	
	НастройкиРасшифровки = ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие);
	
	Если НастройкиРасшифровки <> Неопределено Тогда
		
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
		
		Сформировать(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСхемуКомпоновкиДанныхНаСервере()
	Возврат ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));
	//МакетСКД = Новый СхемаКомпоновкиДанных;
	//РеквОбъ = РеквизитФормыВЗначение("Отчет");
	//МакетСКД = РеквОбъ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
КонецФункции

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(АдресРасшифровки)
Перем ВыполненноеДействие;
	
	Расшифровка = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	
	СхемаКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ДанныеРасшифровкиКД = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровкиКД, Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	
	НастройкиРасшифровки = ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие);
	//Возврат НастройкиРасшифровки;
	
КонецФункции

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;      
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет);      
	ОбработкаРасшифровкиКД = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникНастроек);            
	ВыполненноеДействие = Неопределено;      
	ПараметрДействия = Неопределено;      
	ОбработкаРасшифровкиКД.ВыбратьДействие(Расшифровка, ВыполненноеДействие, ПараметрДействия);            
	Если ВыполненноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда                        
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда                                    
			ОткрытьЗначение(ПараметрДействия);                              
		КонецЕсли;                   
	КонецЕсли;       
	
КонецПроцедуры
